zhdjet/hc32f460/hc32f460_sdk/驱动库及样例/hc32f46x_ddl/example/i2s/i2s_record_wm8731_exck_irq/source/main.c
    /* Wait for press key SW2 to kick start record */
    while(Reset != PORT_GetBit(PortD, Pin03))
    {
        ;   //SW2
    }
    /* Indicate recording */
    LED0_TOGGLE();

    /* Enable I2S RXI function to kick start */
    I2S_FuncCmd(I2S_CH, RxIntEn, Enable);
    /* Enable i2s RX function */
    I2S_FuncCmd(I2S_CH, RxEn, Enable);

    /* Wait for recorder buffer full */
    while(0u == u8RecordEndFlag)
    {
        ;
    }
    I2s_DeInit(I2S_CH);
    NVIC_DisableIRQ(stcIrqRegiConf.enIRQn);
    /* Indicate record finished */
    LED0_TOGGLE();

    /* Wait for press key SW2 to play recoder wav */
    while(Reset != PORT_GetBit(PortD, Pin03))
    {
        ;   //SW2
    }
    /* Buffer prepare for play */
    pu16SoundData = &au16RecorderSoundI2s[0];
    u32Count = 0ul;
    /* Config I2S_SD IO for play */
    PORT_SetFunc(I2S3_PORT, I2S3_SD_IN_PIN, Func_Gpio, Disable);
    PORT_SetFunc(I2S3_PORT, I2S3_SD_PIN, Func_I2s3_Sd, Disable);
    /* Configuration Codec WM8731 to play wav file */
    WM8731_CodecConfigPlay();

    /* Config i2s peripheral */
    I2s_DeInit(I2S_CH);
    stcI2sCfg.u32I2sInterClkFreq = GetI2SClkFreq(I2S_CH);
    stcI2sCfg.enStandrad = Std_Philips;
    stcI2sCfg.enMode = I2sMaster;
    stcI2sCfg.enChanelLen = I2s_ChLen_32Bit;
    stcI2sCfg.enDataBits = I2s_DataLen_16Bit;
    stcI2sCfg.u32AudioFreq = I2S_AudioFreq_8k;
#if(EXCK_ON)
    stcI2sCfg.enMcoOutEn = Disable;
    stcI2sCfg.enExckEn = Enable;
#else
    stcI2sCfg.enMcoOutEn = Enable;
    stcI2sCfg.enExckEn = Disable;
#endif
    I2s_Init(I2S_CH, &stcI2sCfg);

    /* Register TXIRQOUT Int to Vect.No.001 */
    stcIrqRegiConf.enIRQn = Int002_IRQn;
    /* Select I2C Error or Event interrupt function */
    stcIrqRegiConf.enIntSrc = INT_I2S3_TXIRQOUT;
    /* Callback function */
    stcIrqRegiConf.pfnCallback = &I2sTxFifoCallback;
    /* Registration IRQ */
    enIrqRegistration(&stcIrqRegiConf);
    /* Clear Pending */
    NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
    /* Set priority */
    NVIC_SetPriority(stcIrqRegiConf.enIRQn, DDL_IRQ_PRIORITY_15);
    /* Enable NVIC */
    NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);

    /* Enable i2s TX function */
    I2S_FuncCmd(I2S_CH, TxEn, Enable);
    /* Enable I2S TXI function to kick start conmmunication */
    I2S_FuncCmd(I2S_CH, TxIntEn, Enable);

    while(1)
    {
        ;
    }
}

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
